Revit 2026 API

# SpecTypeIdString Class

---

This class contains constants identifying string specs.

SystemObject Autodesk.Revit.DBSpecTypeIdString

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class String
```
```vb
Public NotInheritable Class String
```
```cpp
public ref class String abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type String = class end
```

The SpecTypeIdString type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MultilineText | Multiline Text, in discipline Common. |
|  | Text | Text, in discipline Common. |
|  | Url | URL, in discipline Common. |

#### Reference

Autodesk.Revit.DB Namespace